onepixel0/stm8-sdcc-cmake/StdPeriph/STM8L10x/Libraries/STM8L10x_StdPeriph_Driver/inc/stm8l10x_i2c.h
/**
  ******************************************************************************
  * @file    stm8l10x_i2c.h
  * @author  MCD Application Team
  * @version V1.2.1
  * @date    30-September-2014
  * @brief   This file contains all the functions prototypes for the I2C firmware 
  *          library.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM8L10x_I2C_H
#define __STM8L10x_I2C_H

/* Includes ------------------------------------------------------------------*/
#include "stm8l10x.h"

/* Exported types ------------------------------------------------------------*/
/** @defgroup I2C_Exported_Types
 * @{
 */

/** @defgroup I2C_duty_cycle_in_fast_mode
  * @{
  */
typedef enum
{
  I2C_DutyCycle_2    = (uint8_t)0x00,  /*!< Fast mode Tlow/THigh = 2 */
  I2C_DutyCycle_16_9 = (uint8_t)0x40   /*!< Fast mode Tlow/Thigh = 16/9 */
} I2C_DutyCycle_TypeDef;

/**
  * @}
  */

/** @defgroup I2C_acknowledgement
  * @{
  */
typedef enum
{
  I2C_Ack_Disable = (uint8_t)0x00,  /*!< No acknowledge */
  I2C_Ack_Enable  = (uint8_t)0x04   /*!< Acknowledge Enabled */
} I2C_Ack_TypeDef;
/**
  * @}
  */

/** @defgroup  I2C_Position_Acknowledgement
  * @{
  */
typedef enum
{
  I2C_AckPosition_Current = (uint8_t)0x00,   /*!< Acknowledge on the current byte */
  I2C_AckPosition_Next    = (uint8_t)0x08    /*!< Acknowledge on the next byte */
} I2C_AckPosition_TypeDef;

/**
  * @}
  */

/** @defgroup I2C_acknowledged_address
  * @{
  */
typedef enum
{
  I2C_AcknowledgedAddress_7bit  = (uint8_t)0x00,  /*!< 7-bit slave address (10-bit address not acknowledged) */
  I2C_AcknowledgedAddress_10bit = (uint8_t)0x80   /*!< 10-bit slave address (7-bit address not acknowledged) */
} I2C_AcknowledgedAddress_TypeDef;
/**
  * @}
  */

/** @defgroup I2C_transfer_direction
  * @{
  */

/**
  * Warning: the values correspond to the ADD0 bit position in the OARL register
  */
typedef enum
{
  I2C_Direction_Transmitter = (uint8_t)0x00,  /*!< Transmission direction */
  I2C_Direction_Receiver    = (uint8_t)0x01   /*!< Reception direction */
} I2C_Direction_TypeDef;
/**
  * @}
  */

/** @defgroup I2C_flags_definition
  * @{
  */
/**
  * @brief Elements values convention: 0xXXYY
  *  X = SRx registers index
  *      X = 1 : SR1
  *      X = 2 : SR2
  *      X = 3 : SR3
  *  Y = Flag mask in the register
  */
typedef enum
{
  /* SR1 register flags */
  I2C_FLAG_TXE      = (uint16_t)0x0180,  /*!< Transmit Data Register Empty flag */
  I2C_FLAG_RXNE     = (uint16_t)0x0140,  /*!< Read Data Register Not Empty flag */
  I2C_FLAG_STOPF    = (uint16_t)0x0110,  /*!< Stop detected flag */
  I2C_FLAG_ADD10    = (uint16_t)0x0108,  /*!< 10-bit Header sent flag */
  I2C_FLAG_BTF      = (uint16_t)0x0104,  /*!< Data Byte Transfer Finished flag */
  I2C_FLAG_ADDR     = (uint16_t)0x0102,  /*!< Address Sent/Matched (master/slave) flag */
  I2C_FLAG_SB       = (uint16_t)0x0101,  /*!< Start bit sent flag */

  /* SR2 register flags */
  I2C_FLAG_WUFH     = (uint16_t)0x0220,  /*!< Wake Up From Halt Flag */
  I2C_FLAG_OVR      = (uint16_t)0x0208,  /*!< Overrun/Underrun flag */
  I2C_FLAG_AF       = (uint16_t)0x0204,  /*!< Acknowledge Failure Flag */
  I2C_FLAG_ARLO     = (uint16_t)0x0202,  /*!< Arbitration Loss Flag */
  I2C_FLAG_BERR     = (uint16_t)0x0201,  /*!< Misplaced Start or Stop condition */

  /* SR3 register flags */
  I2C_FLAG_GENCALL  = (uint16_t)0x0310,  /*!< General Call header received Flag */
  I2C_FLAG_TRA      = (uint16_t)0x0304,  /*!< Transmitter Receiver Flag */
  I2C_FLAG_BUSY     = (uint16_t)0x0302,  /*!< Bus Busy Flag */
  I2C_FLAG_MSL      = (uint16_t)0x0301   /*!< Master Slave Flag */
} I2C_FLAG_TypeDef;


/**
  * @}
  */

/** @defgroup I2C_interrupts_definition
  * @{
  */

/**
  * @brief I2C Pending bits
  * Elements values convention: 0xXYZZ
  *  X = SRx registers index
  *      X = 0 : ITR
  *      X = 1 : SR1
  *      X = 2 : SR2
  *  Y = Position of the corresponding Interrupt
  *  ZZ = flag mask in the dedicated register(X register)
  */

typedef enum
{
  I2C_IT_ERR             = (uint16_t)0x0001,  /*!< Error Interruption */
  I2C_IT_EVT             = (uint16_t)0x0002,  /*!< Event Interruption */
  I2C_IT_BUF             = (uint16_t)0x0004,  /*!< Buffer Interruption */
  /* SR1 register */
  I2C_IT_TXE             = (uint16_t)0x1680,  /*!< Transmit Data Register Empty  */
  I2C_IT_RXNE            = (uint16_t)0x1640,  /*!< Read Data Register Not Empty  */
  I2C_IT_STOPF           = (uint16_t)0x1210,  /*!< Stop detected  */
  I2C_IT_ADD10           = (uint16_t)0x1208,  /*!< 10-bit Header sent */
  I2C_IT_BTF             = (uint16_t)0x1204,  /*!< Data Byte Transfer Finished  */
  I2C_IT_ADDR            = (uint16_t)0x1202,  /*!< Address Sent/Matched (master/slave)  */
  I2C_IT_SB              = (uint16_t)0x1201,  /*!< Start bit sent  */
  /* SR2 register */
  I2C_IT_WUFH            = (uint16_t)0x2220,  /*!< Wake Up From Halt  */
  I2C_IT_OVR             = (uint16_t)0x2108,  /*!< Overrun/Underrun  */
  I2C_IT_AF              = (uint16_t)0x2104,  /*!< Acknowledge Failure  */
  I2C_IT_ARLO            = (uint16_t)0x2102,  /*!< Arbitration Loss  */
  I2C_IT_BERR            = (uint16_t)0x2101   /*!< Misplaced Start or Stop condition */
} I2C_IT_TypeDef;
/**
  * @}
  */
  
/** @defgroup I2C_Events
  * @{
  */

/**
  * @brief I2C possible events
  * Values convention: 0xXXYY
  * XX = Event SR3 corresponding value
  * YY = Event SR1 corresponding value
  * @note if Event = EV3_2 the rule above does not apply
  * YY = Event SR2 corresponding value
  */
typedef enum
{
  /**
 ===============================================================================
               I2C Master Events (Events grouped in order of communication)                   
 ===============================================================================  
 */
/**
  * @brief  Communication start
  *
  * After sending the START condition (I2C_GenerateSTART() function) the master
  * has to wait for this event. It means that the Start condition has been correctly
  * released on the I2C bus (the bus is free, no other devices is communicating).
  *
  */
  /* --EV5 */
  I2C_EVENT_MASTER_MODE_SELECT               = (uint16_t)0x0301,  /*!< BUSY, MSL and SB flag */

/**
  * @brief  Address Acknowledge
  *
  * After checking on EV5 (start condition correctly released on the bus), the
  * master sends the address of the slave(s) with which it will communicate
  * (I2C_Send7bitAddress() function, it also determines the direction of the communication:
  * Master transmitter or Receiver).
  * Then the master has to wait that a slave acknowledges his address.
  * If an acknowledge is sent on the bus, one of the following events will
  * be set:
  *
  *  1) In case of Master Receiver (7-bit addressing):
  *  the I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED event is set.
  *
  *  2) In case of Master Transmitter (7-bit addressing):
  *  the I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED is set
  *
  *  3) In case of 10-Bit addressing mode, the master (just after generating the START
  *  and checking on EV5) has to send the header of 10-bit addressing mode (I2C_SendData()
  *  function).
  *  Then master should wait on EV9. It means that the 10-bit addressing
  *  header has been correctly sent on the bus.
  *  Then master should send the second part of the 10-bit address (LSB) using
  *  the function I2C_Send7bitAddress(). Then master should wait for event EV6.
  *
  */
  /* --EV6 */
  I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED = (uint16_t)0x0782,  /*!< BUSY, MSL, ADDR, TXE and TRA flags */
  I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED    = (uint16_t)0x0302,  /*!< BUSY, MSL and ADDR flags */
  /* --EV9 */
  I2C_EVENT_MASTER_MODE_ADDRESS10            = (uint16_t)0x0308,  /*!< BUSY, MSL and ADD10 flags */

/**
  * @brief Communication events
  *
  * If a communication is established (START condition generated and slave address
  * acknowledged) then the master has to check on one of the following events for
  * communication procedures:
  *
  * 1) Master Receiver mode: The master has to wait on the event EV7 then to read
  *    the data received from the slave (I2C_ReceiveData() function).
  *
  * 2) Master Transmitter mode: The master has to send data (I2C_SendData()
  *    function) then to wait on event EV8 or EV8_2.
  *    These two events are similar:
  *     - EV8 means that the data has been written in the data register and is
  *       being shifted out.
  *     - EV8_2 means that the data has been physically shifted out and output
  *       on the bus.
  *     In most cases, using EV8 is sufficient for the application.
  *     Using EV8_2 leads to a slower communication but ensure more reliable test.
  *     EV8_2 is also more suitable than EV8 for testing on the last data transmission
  *     (before Stop condition generation).
  *
  *  @note In case the user software does not guarantee that this event EV7 is
  *  managed before the current byte end of transfer, then user may check on EV7
  *  and BTF flag at the same time (ie. (I2C_EVENT_MASTER_BYTE_RECEIVED | I2C_FLAG_BTF)).
  *  In this case the communication may be slower.
  *
  */
  /* Master RECEIVER mode -----------------------------*/
  /* --EV7 */
  I2C_EVENT_MASTER_BYTE_RECEIVED             = (uint16_t)0x0340,  /*!< BUSY, MSL and RXNE flags */

