onepixel0/stm8-sdcc-cmake/StdPeriph/STM8L10x/Libraries/STM8L10x_StdPeriph_Driver/inc/stm8l10x_i2c.h
/* Initialization and Configuration functions *********************************/
void I2C_Init(uint32_t OutputClockFrequency, uint16_t OwnAddress,
              I2C_DutyCycle_TypeDef I2C_DutyCycle, I2C_Ack_TypeDef I2C_Ack,
              I2C_AcknowledgedAddress_TypeDef I2C_AcknowledgedAddress);
void I2C_Cmd(FunctionalState NewState);
void I2C_GeneralCallCmd(FunctionalState NewState);
void I2C_SoftwareResetCmd(FunctionalState NewState);
void I2C_StretchClockCmd(FunctionalState NewState);
void I2C_GenerateSTART(FunctionalState NewState);
void I2C_GenerateSTOP(FunctionalState NewState);
void I2C_AcknowledgeConfig(FunctionalState NewState);
void I2C_AckPositionConfig(I2C_AckPosition_TypeDef I2C_AckPosition);
void I2C_FastModeDutyCycleConfig(I2C_DutyCycle_TypeDef I2C_DutyCycle);
void I2C_Send7bitAddress(uint8_t Address, I2C_Direction_TypeDef I2C_Direction);

/* Data transfers functions ***************************************************/ 
void I2C_SendData(uint8_t Data);
uint8_t I2C_ReceiveData(void);

/* Interrupts, events and flags management functions **************************/
void I2C_ITConfig(I2C_IT_TypeDef I2C_IT, FunctionalState NewState);

/**
 * @brief
 *  
@verbatim 
================================================================================
                       I2C State Monitoring Functions
================================================================================
 This I2C driver provides three different ways for I2C state monitoring
  depending on the application requirements and constraints:


 1) Basic state monitoring:
    Using I2C_CheckEvent() function:
    It compares the status registers (SR1, SR2 and SR3) content to a given event
    (can be the combination of one or more flags).
    It returns SUCCESS if the current status includes the given flags
    and returns ERROR if one or more flags are missing in the current status.
    - When to use:
      - This function is suitable for most applications as well as for startup
      activity since the events are fully described in the product reference manual
      (RM0013).
      - It is also suitable for users who need to define their own events.
    - Limitations:
      - If an error occurs (ie. error flags are set besides to the monitored flags),
        the I2C_CheckEvent() function may return SUCCESS despite the communication
        hold or corrupted real state.
        In this case, it is advised to use error interrupts to monitor the error
        events and handle them in the interrupt IRQ handler.

        @note
        For error management, it is advised to use the following functions:
          - I2C_ITConfig() to configure and enable the error interrupts (I2C_IT_ERR).
          - I2C_IRQHandler() which is called when the I2C interrupts occur.
          - I2C_GetFlagStatus() or I2C_GetITStatus() to be called into the
           I2C_IRQHandler() function in order to determine which error occurred.
          - I2C_ClearFlag() or I2C_ClearITPendingBit() and/or I2C_SoftwareResetCmd()
            and/or I2C_GenerateStop() in order to clear the error flag and
            source and return to correct communication status.


  2) Advanced state monitoring:
     Using the function I2C_GetLastEvent() which returns the image of both SR1
     & SR3 status registers in a single word (uint16_t) (Status Register 3 value
     is shifted left by 8 bits and concatenated to Status Register 1).
     - When to use:
       - This function is suitable for the same applications above but it allows to
         overcome the limitations of I2C_GetFlagStatus() function (see below).
         The returned value could be compared to events already defined in the
         library (stm8l10x_i2c.h) or to custom values defined by user.
       - This function is suitable when multiple flags are monitored at the same time.
       - At the opposite of I2C_CheckEvent() function, this function allows user to
         choose when an event is accepted (when all events flags are set and no
         other flags are set or just when the needed flags are set like
         I2C_CheckEvent() function).
     - Limitations:
       - User may need to define his own events.
       - Same remark concerning the error management is applicable for this
         function if user decides to check only regular communication flags (and
         ignores error flags).


 3) Flag-based state monitoring:
     Using the function I2C_GetFlagStatus() which simply returns the status of
     one single flag (ie. I2C_FLAG_RXNE ...).
     - When to use:
        - This function could be used for specific applications or in debug phase.
        - It is suitable when only one flag checking is needed (most I2C events
          are monitored through multiple flags).
     - Limitations:
        - When calling this function, the Status register is accessed. Some flags are
          cleared when the status register is accessed. So checking the status
          of one Flag, may clear other ones.
        - Function may need to be called twice or more in order to monitor one
          single event.
          
          
@endverbatim
 *            
 */

/**
 ===============================================================================
                          1. Basic state monitoring                    
 ===============================================================================
*/  
ErrorStatus I2C_CheckEvent(I2C_Event_TypeDef I2C_Event);
/**
 ===============================================================================
                          2. Advanced state monitoring                   
 ===============================================================================  
 */
I2C_Event_TypeDef I2C_GetLastEvent(void);
/**
 ===============================================================================
                          3. Flag-based state monitoring                   
 ===============================================================================  
 */
FlagStatus I2C_GetFlagStatus(I2C_FLAG_TypeDef I2C_FLAG);
void I2C_ClearFlag(I2C_FLAG_TypeDef I2C_FLAG);
ITStatus I2C_GetITStatus(I2C_IT_TypeDef I2C_IT);
void I2C_ClearITPendingBit(I2C_IT_TypeDef I2C_IT);



#endif /* __STM8L10x_I2C_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
